app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produto = Produto.all

INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "Mouse Logitech"], ["descricao", "a"], ["preco", 123.0], ["quantidade", 1], ["created_at", "2023-05-09 13:57:37.767749"], ["updated_at", "2023-05-09 13:57:37.767749"], ["image", nil]]
---
  def create
    valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :image)
    @produto = Produto.new valores
    if @produto.save

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 58]]
---
  def destroy
    remove_id = params[:id]
    Produto.destroy remove_id

SELECT "produtos".* FROM "produtos" WHERE (nome like '%Teclado%')
---
  def busca
    @nome = params[:nome]
    @produto = Produto.where "nome like ?", "%#{@nome}%"